----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
    PixelNormLayer-1                  [-1, 512]               0
EqualizedLinearPropia-2                  [-1, 512]         262,656
         LeakyReLU-3                  [-1, 512]               0
EqualizedLinearPropia-4                  [-1, 512]         262,656
         LeakyReLU-5                  [-1, 512]               0
EqualizedLinearPropia-6                  [-1, 512]         262,656
         LeakyReLU-7                  [-1, 512]               0
EqualizedLinearPropia-8                  [-1, 512]         262,656
         LeakyReLU-9                  [-1, 512]               0
EqualizedLinearPropia-10                  [-1, 512]         262,656
        LeakyReLU-11                  [-1, 512]               0
EqualizedLinearPropia-12                  [-1, 512]         262,656
        LeakyReLU-13                  [-1, 512]               0
EqualizedLinearPropia-14                  [-1, 512]         262,656
        LeakyReLU-15                  [-1, 512]               0
EqualizedLinearPropia-16                  [-1, 512]         262,656
        LeakyReLU-17                  [-1, 512]               0
         GMapping-18              [-1, 10, 512]               0
   PixelNormLayer-19                  [-1, 512]               0
EqualizedLinearPropia-20                  [-1, 512]         262,656
        LeakyReLU-21                  [-1, 512]               0
EqualizedLinearPropia-22                  [-1, 512]         262,656
        LeakyReLU-23                  [-1, 512]               0
EqualizedLinearPropia-24                  [-1, 512]         262,656
        LeakyReLU-25                  [-1, 512]               0
EqualizedLinearPropia-26                  [-1, 512]         262,656
        LeakyReLU-27                  [-1, 512]               0
EqualizedLinearPropia-28                  [-1, 512]         262,656
        LeakyReLU-29                  [-1, 512]               0
EqualizedLinearPropia-30                  [-1, 512]         262,656
        LeakyReLU-31                  [-1, 512]               0
EqualizedLinearPropia-32                  [-1, 512]         262,656
        LeakyReLU-33                  [-1, 512]               0
EqualizedLinearPropia-34                  [-1, 512]         262,656
        LeakyReLU-35                  [-1, 512]               0
         GMapping-36              [-1, 10, 512]               0
       Truncation-37              [-1, 10, 512]               0
       NoiseLayer-38            [-1, 512, 4, 4]             512
             ReLU-39            [-1, 512, 4, 4]               0
   InstanceNorm2d-40            [-1, 512, 4, 4]               0
  EqualizedLinear-41                 [-1, 1024]         525,312
         StyleMod-42            [-1, 512, 4, 4]               0
  CapaS_StyleMode-43            [-1, 512, 4, 4]               0
     Conv2dPropia-44            [-1, 512, 4, 4]       2,359,808
       NoiseLayer-45            [-1, 512, 4, 4]             512
             ReLU-46            [-1, 512, 4, 4]               0
   InstanceNorm2d-47            [-1, 512, 4, 4]               0
  EqualizedLinear-48                 [-1, 1024]         525,312
         StyleMod-49            [-1, 512, 4, 4]               0
  CapaS_StyleMode-50            [-1, 512, 4, 4]               0
       InputBlock-51            [-1, 512, 4, 4]             512
     Conv2dPropia-52              [-1, 3, 4, 4]           1,539
       GSynthesis-53              [-1, 3, 4, 4]               0
================================================================
Total params: 7,616,003
Trainable params: 7,615,491
Non-trainable params: 512
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 1.02
Params size (MB): 29.05
Estimated Total Size (MB): 30.07
----------------------------------------------------------------
